{
  "journalEntries": [
    {
      "id": 0,
      "date": "2020-01-16",
      "title": "JavaScript Objects",
      "contents": "Objects are containers for properties. Today we learned about creating and accessing information within objects, and how they differ from arrays.",
      "mood": "excited"
    },
    {
      "date": "2020-01-17",
      "title": "Functions in JavaScript",
      "contents": "Today we learned about the reusable code that are functions. Pure functions are consistent and will return the same value regardless of the number of times they are called. Impure functions produce different results each time they are called.",
      "mood": "happy",
      "id": 1
    },
    {
      "id": 2,
      "date": "2020-01-17",
      "title": "Objects, Methods, and an intro to 'this'",
      "contents": "We dug deeper into the concepts behind Object Oriented Programming, today. We learned about functions inside of objects, which we refer to as methods. To refer to a property from within the same object, we use the 'this' keyword.",
      "mood": "challenged"
    },
    {
      "id": 4,
      "date": "2020-01-21",
      "title": "JSON",
      "contents": "We started into JSON, but I was puking my guts out in the bathroom. I audibly prayed to God to get home, for resting / running to the bathroom a few times per hour, for a few hours. Plugged in late to read, but already know I'm gonna be lost. Will need to study this more into the end of the week. Need to read Chapters 9 and 10.",
      "mood": "challenged"
    },
    {
      "date": "2020-01-31",
      "title": "POST to JSON server",
      "contents": "As part of the 'Daily Journal 7' exercise, we are implementing the learned process of POSTing an object to a remote JSON file that is running on a JSON server. If this post shows up, it is because I have successfully completed parts of the 'Daily Journal 7' exercise.",
      "mood": "happy",
      "id": 5
    },
    {
      "id": 6,
      "date": "2020-02-07",
      "title": "EDIT JSON data",
      "contents": "My \"Daily Journal\" is growing stronger. Having learned how to fetch and PUT information into a JSON file, I am now able to edit my journal entries. I'm excited to be able to read through my code with a better understanding, feeling great today. I might need to add a more energetic mood later and update this entry accordingly.",
      "mood": "excited"
    }
  ]
}